# Дана сторона квадрата. Найти его периметр.

a = int(input('Введите значение a: '))
P = 4 * a
print('Периметр квадрата со стороной', a, '=', P)