# Дан радиус окружности. Найти ее диаметр.

r = int(input('Введите значение радиуса окружности: '))
d = 2 * r
print('Диаметр окружности с радиусом', r, '=', d)