# составить программу для решения уравнения
# а)

x =  int(input('Введите значение x: '))
y =  int(input('Введите значение y: '))
z = 2 * x ** 3 - 3.44 * x * y + 2.3 * x ** 2 - 7.1 * y + 2
print(z)

# б)
a =  int(input('Введите значение a: '))
b =  int(input('Введите значение b: '))
c = 3.14 * (a + b) ** 3 + 2.75 * b ** 2 - 12.7 * a - 4.1
print(c)