# Дано расстояние в сантиметрах. Найти число полных метров в нем.

S = int(input('Введите расстояние в сантиметрах: '))
print('Расстояние в метрах =', S/100) 