#  Дан прямоугольник с размерами 543х 130 мм. Сколько
# квадратов со стороной 130 мм можно отрезать от него?

print(' Дан прямоугольник с размерами 543х 130 мм. Сколько квадратов со стороной 130 мм можно отрезать от него?')
a = 543//130
print(a)