# В подъезде № 1 пятиэтажного жилого дома 15 квартир.
# Определить, на каком этаже этого подъезда находится квартира
# с заданным номером.

n = int(input('n = '))
print(-(-n//15), 'этаж')