# Определить, в какую из областей - I или II (рис. 4.2)

A = int(input('Введите y точки А: '))
if A > 3:
    print('I')
    
else:
        print('II')